bench/results/java25/20260425T114917Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 300, "warmup_s": 120, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 5452.16, "p50": "4.21ms", "p95": "7.24ms", "p99": "8.42ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 5m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     4.40ms    1.32ms  35.46ms   72.90%\n    Req/Sec     1.37k   112.98     1.63k    73.92%\n  Latency Distribution\n     50%    4.21ms\n     75%    5.09ms\n     90%    6.06ms\n     99%    8.42ms\n  1635777 requests in 5.00m, 372.84MB read\nRequests/sec:   5452.16\nTransfer/sec:      1.24MB"}